modules/person/controllers/PostController.php

    public function actionDialogs()
    {

        $users = Users::findOne(['id' => Yii::$app->user->getId()]);
---
SELECT * FROM `users` WHERE `id`=2

    public function actionMessages(){
        $dialog_id = Yii::$app->request->get('d');
        $id = Yii::$app->user->getId();
        $send_form = new SendForm();
        if($send_form->load(Yii::$app->request->post()) && $send_form->validate()){
            $send_mess = new Messages();
            $send_mess->message = $send_form->message;
            $send_mess->dialog_id = $dialog_id;
            $send_mess->save();                 //кому отправить письм
            return $this->refresh();
        }


        $correspondence = Messages::findAll(['dialog_id' => $dialog_id]);
---
INSERT INTO `messages` (`message`, `dialog_id`) VALUES ('vxfdhgedsrfhbsthb', 0)
SELECT * FROM `messages` WHERE `dialog_id`='\"3\"'