models/Users.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `users` WHERE `id`=2

    public  static function findByUsername($username){
        return static::findOne(['login'=>$username]);
---
SELECT * FROM `users` WHERE `login`='max'